### Data Fusion and Reshaping for Complex Analytica

#### Data Fusion : data fusion is nothing but merging the multiple tables or taking intersection on one common column

In [1]:
# importing required libraries
import pandas as pd

In [2]:
students = pd.DataFrame({
    "student_id": [1, 2, 3, 4],
    "name": ["Adarsh", "Priya", "Rohan", "Neha"],
    "age": [21, 22, 23, 22]
})

marks = pd.DataFrame({
    "student_id": [1, 2, 3, 4],
    "math": [85, 90, 78, 88],
    "science": [92, 81, 74, 95],
    "english": [88, 76, 89, 84]
})

attendance = pd.DataFrame({
    "student_id": [1, 2, 3, 4],
    "days_present": [40, 38, 35, 42],
    "total_days": [45, 45, 45, 45]
})

In [3]:
print(students,'\n')
print(marks,'\n')
print(attendance)

   student_id    name  age
0           1  Adarsh   21
1           2   Priya   22
2           3   Rohan   23
3           4    Neha   22

   student_id  math  science  english
0           1    85       92       88
1           2    90       81       76
2           3    78       74       89
3           4    88       95       84

   student_id  days_present  total_days
0           1            40          45
1           2            38          45
2           3            35          45
3           4            42          45

In [15]:
merged = students.merge(marks, on="student_id").merge(attendance, on="student_id")
print(merged)
merged.to_csv('merged_data',index = False)

   student_id    name  age  math  science  english  days_present  total_days
0           1  Adarsh   21    85       92       88            40          45
1           2   Priya   22    90       81       76            38          45
2           3   Rohan   23    78       74       89            35          45
3           4    Neha   22    88       95       84            42          45

In [5]:
long_format = pd.melt(
    merged,
    id_vars=["student_id", "name", "age", "days_present", "total_days"],
    value_vars=["math", "science", "english"],
    var_name="subject",
    value_name="score"
)
print(long_format.head())

   student_id    name  age  days_present  total_days  subject  score
0           1  Adarsh   21            40          45     math     85
1           2   Priya   22            38          45     math     90
2           3   Rohan   23            35          45     math     78
3           4    Neha   22            42          45     math     88
4           1  Adarsh   21            40          45  science     92

In [6]:
pivot = long_format.pivot_table(
    index=["student_id", "name"],
    columns="subject",
    values="score"
).reset_index()
print(pivot)

subject  student_id    name  english  math  science
0                 1  Adarsh     88.0  85.0     92.0
1                 2   Priya     76.0  90.0     81.0
2                 3   Rohan     89.0  78.0     74.0
3                 4    Neha     84.0  88.0     95.0

In [7]:
data = {'City': ['New York', 'Los Angeles'],
        '2020_Population': [8400000, 3900000],
        '2021_Population': [8500000, 3950000]}
df = pd.DataFrame(data)

print("Original DataFrame:")
print(df)

# Melt the DataFrame
df_melted = pd.melt(df, id_vars=['City'], 
                    value_vars=['2020_Population', '2021_Population'],
                    var_name='Year', 
                    value_name='Population')

print("\nMelted DataFrame:")
print(df_melted)

Original DataFrame:
          City  2020_Population  2021_Population
0     New York          8400000          8500000
1  Los Angeles          3900000          3950000

Melted DataFrame:
          City             Year  Population
0     New York  2020_Population     8400000
1  Los Angeles  2020_Population     3900000
2     New York  2021_Population     8500000
3  Los Angeles  2021_Population     3950000

### Reshaping: changing the structure of data

In [16]:
# I'm going to use merged data

df1 = pd.read_csv('merged_data')

In [17]:
df1

   student_id    name  age  math  science  english  days_present  total_days
0           1  Adarsh   21    85       92       88            40          45
1           2   Priya   22    90       81       76            38          45
2           3   Rohan   23    78       74       89            35          45
3           4    Neha   22    88       95       84            42          45

In [18]:
print("shape of data before mel")
long_format = pd.melt(
    df1,
    id_vars=["student_id", "name", "age", "days_present", "total_days"],
    value_vars=["math", "science", "english"],
    var_name="subject",
    value_name="score"
)

In [19]:
long_format

    student_id    name  age  days_present  total_days  subject  score
0            1  Adarsh   21            40          45     math     85
1            2   Priya   22            38          45     math     90
2            3   Rohan   23            35          45     math     78
3            4    Neha   22            42          45     math     88
4            1  Adarsh   21            40          45  science     92
5            2   Priya   22            38          45  science     81
6            3   Rohan   23            35          45  science     74
7            4    Neha   22            42          45  science     95
8            1  Adarsh   21            40          45  english     88
9            2   Priya   22            38          45  english     76
10           3   Rohan   23            35          45  english     89
11           4    Neha   22            42          45  english     84

In [25]:
# reshaping back
pivot = long_format.pivot_table(
    index=["student_id", "name"],
    columns="subject",
    values="score"
).reset_index()
print(pivot)
print()
df1

subject  student_id    name  english  math  science
0                 1  Adarsh     88.0  85.0     92.0
1                 2   Priya     76.0  90.0     81.0
2                 3   Rohan     89.0  78.0     74.0
3                 4    Neha     84.0  88.0     95.0

   student_id    name  age  math  science  english  days_present  total_days
0           1  Adarsh   21    85       92       88            40          45
1           2   Priya   22    90       81       76            38          45
2           3   Rohan   23    78       74       89            35          45
3           4    Neha   22    88       95       84            42          45